# Part I. The software

### Capítulo 3. The Basics and the MySQL Client

In [ ]:
-- Create database 'test' and show all the databases
CREATE DATABASE test;
SHOW DATABASES;

In [ ]:
-- Create table 'books' in the database 'test'. It has the columns 'book_id', 'title' and 'status'.
CREATE TABLE test.books(
    book_id INT, -- Column 'book_id' is of type INT
    title TEXT, -- Column 'title' is of type TEXT
    status INT -- Column 'statu' is of type 'INT'
);

In [ ]:
-- Show the tables of database 'test'
SHOW TABLES FROM test;

In [ ]:
-- Specify the database ('test') that is going to be used in the next commands
USE test;

In [ ]:
-- Now it is not necessary to use the 'From test' subcommand in the last one
SHOW TABLES;

In [ ]:
-- Show the description of each column of the table (books)
DESCRIBE books;

In [ ]:
-- Insert data in the table 'books'
INSERT INTO books VALUES(100, 'Heart of Darkness', 0);
INSERT INTO books VALUES(101, 'The Catcher of the Rye', 1);
INSERT INTO books VALUES(102, 'My Antonia', 0);

In [ ]:
-- SELECT all columns and display them
SELECT * FROM books;

In [ ]:
-- Filter the files by those values WHERE status = 1
SELECT * FROM books
WHERE status = 1;

In [ ]:
-- The same than the last cell (change 1 by 0), but instead a semicolon is '\G' that shows the results as a batch of lines for each record
SELECT * FROM books
WHERE status = 0 \G

In [ ]:
-- UPDATE the data in the table
UPDATE books SET status = 1 WHERE book_id = 102;

-- SHOW the table modified
SELECT * FROM books WHERE status = 1;

In [ ]:
-- UPDATE and SHOW data in other cell
UPDATE books SET status = 0 WHERE book_id = 101;
SELECT * FROM books WHERE status = 0;

In [ ]:
-- UPDATE more than two items at same statement
UPDATE books
SET title = 'The Catcher in the Rye', status = 1
WHERE book_id = 101;

In [ ]:
-- CREATE other table and INSERT values
CREATE TABLE status_names(
    status_id INT,
    status_name CHAR(8)
);
INSERT INTO status_names VALUES(0, 'Inactive'), (1, 'Active');

In [ ]:
-- SHOW the new table
SELECT * FROM status_names;

In [ ]:
-- JOIN both tables and show specific columns filter by specific files
SELECT book_id, title, status_name
FROM books JOIN status_names
WHERE status = status_id;

---

# Part II. Database Structure

### Capítulo 4. Creating Databases and Tables

In [ ]:
-- CREATE the database
CREATE DATABASE rookery;

In [ ]:
-- DROP (Delete) table
DROP DATABASE rookery;

-- CREATE again the database
CREATE DATABASE rookery -- Database created
CHARACTER SET latin1 -- Default characters used in database's table are 'Latin letters'
COLLATE latin1_bin; -- Default method of sorting is based on binary 'Latin characters'

In [ ]:
-- SHOW the database
SHOW DATABASES;

In [ ]:
-- Set the database as default
USE rockery;

In [ ]:
-- CREATE a table in the new database
CREATE TABLE birds(
    bird_id INT AUTO_INCREMENT PRIMARY KEY, -- PRIMARY KEY is the unique statement which define the file in the table and database
    scientific_name VARCHAR(255) UNIQUE, -- UNIQUE means that there are not equal values in the column
    common_name VARCHAR(50), 
    family_id INT,
    description TEXT
);

In [ ]:
-- Show the characteristics of the table
DESCRIBE birds;

In [ ]:
-- Insert various values in specific columns of the table
INSERT INTO birds (scientific_name, common_name)
VALUES ('Charadrius vociferus', 'Killdeer'),
('Gavia immer', 'Great Northern Loon'),
('Aix sponsa', 'Wood Duck'),
('Chordeiles minor', 'Common Nighthawk'),
('Sitta carolinensis', ' White-breasted Nuthatch'),
('Apteryx mantelli', 'North Island Brown Kiwi');

In [ ]:
-- Show all columns and values in table birds
SELECT * FROM birds;

In [ ]:
-- CREATE another database and a table in it
CREATE DATABASE birdwatchers;
CREATE TABLE birdwatchers.humans(
    human_id INT AUTO_INCREMENT PRIMARY KEY, -- AUTO_INCREMENT does a default value in the column based in the last value
    formal_title VARCHAR(25),
    name_first VARCHAR(25),
    name_last VARCHAR(25),
    email_address VARCHAR(255)
);

In [ ]:
-- Add values in the table 
INSERT INTO birdwatchers.humans (formal_title, name_first, name_last, email_address)
VALUES('Mr.', 'Russell', 'Dyer', 'russell@mysqlresources.com'),
('Mr.', 'Richard', 'Stringer', 'richard@mysqlresources.com'),
('Ms.', 'Rusty', 'Osborne', 'rusty@mysqlresources.com'),
('Ms.', 'Lexi', 'Hollar', 'alexandra@mysqlresources.com');

In [ ]:
-- The 'SHOW CREATE TABLE' let you know de description of the columns in table
SHOW CREATE TABLE birds \G

In [ ]:
-- Do other table with extra information (family) related to the birds and can be equal depending on the birds
CREATE TABLE bird_families (
    family_id INT AUTO_INCREMENT PRIMARY KEY,
    scientific_name VARCHAR(255) UNIQUE,
    brief_description VARCHAR(255) 
);

In [ ]:
-- Create a table with an specific encoding, that is better than latin1
CREATE TABLE bird_orders (
    order_id INT AUTO_INCREMENT PRIMARY KEY,
    scientific_name VARCHAR(255) UNIQUE,
    brief_description VARCHAR(255),
    order_image BLOB
) DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci; -- Do the default encoding as UTF-8. It is greater than latin1

---

### Capítulo 5. Altering tables.

In [ ]:
-- Change one of the default values or set one of the options. It is done with ALTER
ALTER TABLE bird_families
ADD COLUMN order_id INT;

In [ ]:
-- To create a copy of a table we use the command LIKE
CREATE TABLE test.birds_new LIKE birds;

In [ ]:
-- Set 'test' as the default database and show the description of birds_new table
USE test;
DESCRIBE birds_new;

In [ ]:
-- When we did the copy, we just copied the structure, not the data. We can do it with SELECT
INSERT INTO birds_new
SELECT * FROM rookery.birds;

In [ ]:
-- The next method is to do the copy of data. The structure is not copy. There is missing AUTO_INCREMENT and PRIMARY_KEY
CREATE TABLE birds_new_alternative
SELECT * FROM rookery.birds;

In [ ]:
-- Delete the last table
DROP TABLE birds_new_alternative;

In [ ]:
-- Add a new column to the table
ALTER TABLE birds_new
ADD COLUMN wing_id CHAR(2);

In [ ]:
-- Show the description of the table
DESCRIBE birds_new;

In [ ]:
-- Delete the column because is at the end of the table, but we need it in other place
ALTER TABLE birds_new
DROP COLUMN wing_id;

In [ ]:
-- Add the new column after family_id. If need to put it on the first column, change AFTER to FIRST
ALTER TABLE birds_new
ADD COLUMN wing_id CHAR(2) AFTER family_id;

In [ ]:
-- Add differente columns in the position needed. And change the width of a column
ALTER TABLE birds_new
ADD COLUMN body_id CHAR(2) AFTER wing_id,
ADD COLUMN bill_id CHAR(2) AFTER body_id,
ADD COLUMN endangered BIT DEFAULT b'1' AFTER bill_id, -- The BIT type is boolean (0 or 1)
CHANGE COLUMN common_name common_name VARCHAR(255);

In [ ]:
-- Modify a column values of specific lines
UPDATE birds_new SET endangered = 0
WHERE bird_id IN(1,2,4,5);

In [ ]:
-- Display specific columns of the table filtered by an specific value in a column
SELECT bird_id, scientific_name, common_name
FROM birds_new
WHERE endangered \G -- It is equal to WHERE endangered = 1

In [ ]:
-- Display all the columns, but where endangered = 0
SELECT * FROM birds_new
WHERE NOT endangered \G

In [ ]:
-- Because are several degrees of endangered, so we can modify the type of values by ENUM via MODIFY COLUMN
ALTER TABLE birds_new
MODIFY COLUMN endangered
ENUM('Extinct',
    'Extinct in Wild',
    'Threatened - Critically Endangered',
    'Threatened - Endangered',
    'Threatened - Vulnerable',
    'Lower Risk - Conservation Dependent',
    'Lower Risk - Near Threatened',
    'Lower Risk - Least Concern')
AFTER family_id;

In [ ]:
-- Show the description of the specific column
SHOW COLUMNS FROM birds_new LIKE 'endangered' \G

In [ ]:
-- Set all the values of the ENUM column of an specific value. If we know the order it is easy
UPDATE birds_new
SET endangered = 7;

In [ ]:
-- USE other database and create tables
USE birdwatchers;

CREATE TABLE surveys(
    survey_id INT AUTO_INCREMENT KEY,
    survey_name VARCHAR(255)
);

CREATE TABLE survey_questions(
    question_id INT AUTO_INCREMENT KEY,
    survey_id INT,
    question VARCHAR(255),
    choices BLOB -- BLOB is a generic type, and we can use it to store a dynamic column
);

CREATE TABLE survey_answers(
    answer_id INT AUTO_INCREMENT KEY,
    human_id INT,
    question_id INT,
    date_answered DATETIME,
    answer VARCHAR(255)
);

In [ ]:
-- Put some data in the tables
INSERT INTO surveys (survey_name)
VALUES("Favorite Birding Location");

INSERT INTO survey_questions (survey_id, question, choices)
VALUES(LAST_INSERT_ID(),
    "What's your favorite setting for bird-watching?",
    COLUMN_CREATE('1', 'forest', '2', 'shore', '3', 'backyard') -- This works to create an enumerate with specific key and value 1 -> forest, 2 -> shore, 3 -> backyard
);

INSERT INTO surveys (survey_name)
VALUES("Preferred Birds");

INSERT INTO survey_questions (survey_id, question, choices)
VALUES(LAST_INSERT_ID(),
    "Which type of birds do you like best?",
    COLUMN_CREATE('1', 'perching', '2', 'shore', '3', 'fowl', '4', 'rapture') 
);

In [ ]:
-- Show the data in an specific format
SELECT COLUMN_GET(choices, 3 AS CHAR) -- COLUMN_GET select the column (first argument) the key to be selected (3) and the type to be expressed
AS 'Location'
FROM survey_questions
WHERE survey_id = 1;

In [ ]:
-- INSERT values into the table
INSERT INTO survey_answers (human_id, question_id, date_answered, answer)
VALUES (29, 1, NOW(), 2), -- NOW() is the DATETIME format for the now time
(29, 2, NOW(), 2),
(35, 1, NOW(), 1),
(35, 2, NOW(), 1),
(26, 1, NOW(), 2),
(26, 2, NOW(), 1),
(27, 1, NOW(), 2),
(27, 2, NOW(), 4),
(16, 1, NOW(), 3),
(3, 1, NOW(), 1),
(3, 2, NOW(), 1);

In [ ]:
-- Count the votes for the first survey
SELECT IFNULL(COLUMN_GET(choices, answer AS CHAR), 'total') AS 'Birding Site', COUNT(*) AS 'Votes'
FROM survey_answers
JOIN survey_questions USING(question_id)
WHERE survey_id = 1 AND question_id = 1
GROUP BY answer WITH ROLLUP;

In [ ]:
-- CREATE a table for the conservation_stattus
CREATE TABLE rookery.conservation_status(
    status_id INT AUTO_INCREMENT PRIMARY KEY,
    conservation_category CHAR(10),
    conservation_state CHAR(25)
);

In [ ]:
-- Add the values for the categories and states
INSERT INTO rookery.conservation_status (conservation_category, conservation_state)
VALUES('Extinct','Extinct'),
('Extinct','Extinct in Wild'),
('Threatened','Critically Endangered'),
('Threatened','Endangered'),
('Threatened','Vulnerable'),
('Lower Risk','Conservation Dependent'),
('Lower Risk','Near Threatened'),
('Lower Risk','Least Concern');

In [ ]:
-- SHOW the table
SELECT * FROM rookery.conservation_status;

In [ ]:
-- Alter the table and change to name to connect later to the new table created
ALTER TABLE birds_new
CHANGE COLUMN endangered conservation_status_id INT DEFAULT 8;

In [ ]:
-- Change the default value
ALTER TABLE birds_new
ALTER conservation_status_id SET DEFAULT 7;

In [ ]:
-- Delete the default value.
ALTER TABLE birds_new
ALTER conservation_status_id DROP DEFAULT;

In [ ]:
-- SHOW the column auto_increment by a filter
SELECT auto_increment
FROM information_schema.tables
WHERE table_name = 'birds';

In [ ]:
-- Return to the database rookery and modify the deafult value of the next add to 10 
USE rookery
ALTER TABLE birds
AUTO_INCREMENT = 10;

In [ ]:
-- Create an empty column
CREATE TABLE birds_new LIKE birds;

In [ ]:
-- See the description of each table, and show the copy is empty
DESCRIBE birds;
DESCRIBE birds_new;
SELECT * FROM birds_new;

In [ ]:
-- Show the description of a table
SHOW CREATE TABLE birds \G

In [ ]:
-- Modify the next value of the value will add
ALTER TABLE birds_new
AUTO_INCREMENT = 6;

In [ ]:
-- Create the table as a copy of some columns of other tables
CREATE TABLE birds_details
SELECT bird_id, description
FROM birds;

In [ ]:
-- Get the description
DESCRIBE birds_details;

In [ ]:
-- Delete a column
ALTER TABLE birds
DROP COLUMN description;

In [ ]:
-- Rename some columns
RENAME TABLE rookery.birds TO rookery.birds_old,
test.birds_new TO rookery.birds;

In [ ]:
-- Show the tables in all databases starting with 'birds'
SHOW TABLES IN rookery LIKE 'birds%';

---

# Part III. Basics of Handling Data

### Capítulo 6. Inserting Data.